#+latex_header: \usepackage{../research}
#+bind: org-latex-minted-options (("bgcolor" "code"))
#+bind: org-latex-default-figure-position "H"
#+bind: org-latex-image-default-width "\\linewidth"
#+property: header-args :eval no-export :exports both :dir source

#+title: Sign Detection
#+date: Updated: \today
*Started 1/28/2020*

**** Downloading Images from AWS S3 Bucket
    #+begin_src bash :async :exports code :dir ""
if [[ ! -d "images" ]]; then
    wget https://s3.us-east-2.amazonaws.com/naturalimages02/images.tar.gz
    tar -xzf images.tar.gz
    rm -f images.tar.gz*
fi;
echo "DONE!"
    #+end_src

    #+RESULTS:
    : DONE!

**** Training
     #+begin_src python :results output :async
import keras
from keras.models import Model, load_model
from keras.layers import Activation, Dropout, Flatten, Dense
from keras.preprocessing.image import ImageDataGenerator
from keras.applications.vgg16 import VGG16
import batchPreparation as bp

base_model = VGG16(weights='imagenet', include_top=False, input_shape=(bp.image_size, bp.image_size, 3))

for layer in base_model.layers: layer.trainable = False
 
model = keras.models.Sequential()
model.add(base_model)
 
model.add(Flatten())
model.add(Dense(1024, activation='relu'))
model.add(Dense(1024, activation='relu'))
model.add(Dense(bp.num_class, activation='softmax'))
 
print(model.summary())
     #+end_src

     #+RESULTS:
     #+begin_example
     Found 6899 images belonging to 8 classes.
     Model: "sequential_1"
     _________________________________________________________________
     Layer (type)                 Output Shape              Param #   
     =================================================================
     vgg16 (Model)                (None, 7, 7, 512)         14714688  
     _________________________________________________________________
     flatten_1 (Flatten)          (None, 25088)             0         
     _________________________________________________________________
     dense_1 (Dense)              (None, 1024)              25691136  
     _________________________________________________________________
     dense_2 (Dense)              (None, 1024)              1049600   
     _________________________________________________________________
     dense_3 (Dense)              (None, 8)                 8200      
     =================================================================
     Total params: 41,463,624
     Trainable params: 26,748,936
     Non-trainable params: 14,714,688
     _________________________________________________________________
     None
     #+end_example
